In [1]:
import sys
import platform
import pandas as pd
print(f"Executable Python: {sys.executable}")
print(f"Python Version: {platform.python_version()}")

#To show multiple outputs and misc. changes
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all" # Show all results without print (last_expr)

Executable Python: C:\Users\maity\.conda\envs\aku_mldl\python.exe
Python Version: 3.9.6

In [2]:
df= pd.read_csv('G:\My Drive\Coursera\movie_data.csv')
df

,Movie Title,Release Date,Wikipedia URL,Genre,Director (1),Director (2),Cast (1),Cast (2),Cast (3),Cast (4),Cast (5),Budget,Revenue
0,10 Cloverfield Lane,2016-03-08,https://en.wikipedia.org/wiki/10_Cloverfield_Lane,Thriller,Dan Trachtenberg,NaN,Mary Elizabeth Winstead,John Goodman,John Gallagher,NaN,NaN,"$15,000,000.00","$108,300,000.00"
1,13 Hours: The Secret Soldiers of Benghazi,2016-01-15,https://en.wikipedia.org/wiki/13_Hours:_The_Se...,Action,Michael Bay,NaN,James Badge Dale,John Krasinski,Toby Stephens,Pablo Schreiber,Max Martini,"$45,000,000.00","$69,400,000.00"
2,2 Guns,2013-08-02,https://en.wikipedia.org/wiki/2_Guns,Action,Baltasar Kormákur,NaN,Mark Wahlberg,Denzel Washington,Paula Patton,Bill Paxton,Edward James Olmos,"$61,000,000.00","$131,900,000.00"
3,21 Jump Street,2012-03-16,https://en.wikipedia.org/wiki/21_Jump_Street_(...,Comedy,Phil Lord,Chris Miller,Jonah Hill,Channing Tatum,Ice Cube,Brie Larson,Rob Riggle,"$55,000,000.00","$201,500,000.00"
4,22 Jump Street,2014-06-04,https://en.wikipedia.org/wiki/22_Jump_Street,Action,Phil Lord,Chris Miller,Channing Tatum,Jonah Hill,Ice Cube,NaN,NaN,"$84,500,000.00","$331,300,000.00"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
503,X-Men: Days of Future Past,2014-05-10,https://en.wikipedia.org/wiki/X-Men:_Days_of_F...,Action,Bryan Singer,NaN,Hugh Jackman,James McAvoy,Michael Fassbender,Halle Berry,Jennifer Lawrence,"$200,000,000.00","$747,900,000.00"
504,You're Next,2013-08-23,https://en.wikipedia.org/wiki/You%2527re_Next,Horror,Adam Wingard,NaN,Sharni Vinson,Joe Swanberg,AJ Bowen,Nicholas Tucci,Barbara Crampton,"$1,000,000.00","$26,800,000.00"
505,Zero Dark Thirty,2012-12-19,https://en.wikipedia.org/wiki/Zero_Dark_Thirty,Drama,Kathryn Bigelow,NaN,Jessica Chastain,Chris Pratt,Joel Edgerton,Kyle Chandler,Jason Clarke,"$40,000,000.00","$132,800,000.00"
506,Zhong Kui: Snow Girl and the Dark Crystal,2015-02-19,https://en.wikipedia.org/wiki/Zhong_Kui:_Snow_...,Romance,Peter Pau,NaN,Li Bingbing,Chen Kun,Yang Zishan,Winston Chao,Bao Bei'er,"$30,000,000.00","$64,470,000.00"
507,Zoolander 2,2016-02-12,https://en.wikipedia.org/wiki/Zoolander_2,Comedy,Ben Stiller,NaN,Ben Stiller,Owen Wilson,Christine Taylor,Will Ferrell,Penélope Cruz,"$50,000,000.00","$56,000,000.00"

In [3]:
df['Revenue'].max()

'$99,800,000.00'

In [4]:
df['Movie Title'][df['Genre']=='Thriller']

0        10 Cloverfield Lane
14         A Most Wanted Man
88             Don't Breathe
106           Eye in the Sky
220                    Nerve
228                 Non-Stop
230         Now You See Me 2
241    Paranormal Activity 4
352            The Conjuring
364            The Equalizer
371                 The Gift
376               The Gunman
416         The November Man
421          The Perfect Guy
431                The Raven
432             The Revenant
Name: Movie Title, dtype: object

In [5]:
df.fillna(0,inplace =True)

In [6]:
rows ,columns = df.shape

In [7]:
rows
columns

508

13

In [8]:
df.head(2)

,Movie Title,Release Date,Wikipedia URL,Genre,Director (1),Director (2),Cast (1),Cast (2),Cast (3),Cast (4),Cast (5),Budget,Revenue
0,10 Cloverfield Lane,2016-03-08,https://en.wikipedia.org/wiki/10_Cloverfield_Lane,Thriller,Dan Trachtenberg,0,Mary Elizabeth Winstead,John Goodman,John Gallagher,0,0,"$15,000,000.00","$108,300,000.00"
1,13 Hours: The Secret Soldiers of Benghazi,2016-01-15,https://en.wikipedia.org/wiki/13_Hours:_The_Se...,Action,Michael Bay,0,James Badge Dale,John Krasinski,Toby Stephens,Pablo Schreiber,Max Martini,"$45,000,000.00","$69,400,000.00"

In [9]:
df.tail(5)

,Movie Title,Release Date,Wikipedia URL,Genre,Director (1),Director (2),Cast (1),Cast (2),Cast (3),Cast (4),Cast (5),Budget,Revenue
503,X-Men: Days of Future Past,2014-05-10,https://en.wikipedia.org/wiki/X-Men:_Days_of_F...,Action,Bryan Singer,0,Hugh Jackman,James McAvoy,Michael Fassbender,Halle Berry,Jennifer Lawrence,"$200,000,000.00","$747,900,000.00"
504,You're Next,2013-08-23,https://en.wikipedia.org/wiki/You%2527re_Next,Horror,Adam Wingard,0,Sharni Vinson,Joe Swanberg,AJ Bowen,Nicholas Tucci,Barbara Crampton,"$1,000,000.00","$26,800,000.00"
505,Zero Dark Thirty,2012-12-19,https://en.wikipedia.org/wiki/Zero_Dark_Thirty,Drama,Kathryn Bigelow,0,Jessica Chastain,Chris Pratt,Joel Edgerton,Kyle Chandler,Jason Clarke,"$40,000,000.00","$132,800,000.00"
506,Zhong Kui: Snow Girl and the Dark Crystal,2015-02-19,https://en.wikipedia.org/wiki/Zhong_Kui:_Snow_...,Romance,Peter Pau,0,Li Bingbing,Chen Kun,Yang Zishan,Winston Chao,Bao Bei'er,"$30,000,000.00","$64,470,000.00"
507,Zoolander 2,2016-02-12,https://en.wikipedia.org/wiki/Zoolander_2,Comedy,Ben Stiller,0,Ben Stiller,Owen Wilson,Christine Taylor,Will Ferrell,Penélope Cruz,"$50,000,000.00","$56,000,000.00"

In [10]:
df.columns

Index(['Movie Title', 'Release Date', 'Wikipedia URL', 'Genre', 'Director (1)',
       'Director (2)', 'Cast (1)', 'Cast (2)', 'Cast (3)', 'Cast (4)',
       'Cast (5)', 'Budget ', 'Revenue'],
      dtype='object')

In [11]:
df.Genre.head()

0    Thriller
1      Action
2      Action
3      Comedy
4      Action
Name: Genre, dtype: object

In [12]:
df['Genre'].unique( )

array(['Thriller', 'Action', 'Comedy', 'Biography', 'Drama', 'Crime',
       'Adventure', 'Horror', 'Sci-Fi', 'Romance', 'Musical', 'Fantasy',
       'Mystery', 'Family', 'Religious', 'Animation', 'Documentary'],
      dtype=object)

In [13]:
type(df['Release Date'])

pandas.core.series.Series

In [14]:
df[['Release Date','Genre']].head(2)

  Release Date     Genre
0   2016-03-08  Thriller
1   2016-01-15    Action

In [15]:
df['Release Date'].max()

'2016-08-26'

In [16]:
df.describe()

,Movie Title,Release Date,Wikipedia URL,Genre,Director (1),Director (2),Cast (1),Cast (2),Cast (3),Cast (4),Cast (5),Budget,Revenue
count,508,508,508,508,508,508,508,508,508,508,508,508,508
unique,508,330,508,17,414,40,345,403,413,408,354,147,447
top,10 Cloverfield Lane,2015-12-25,https://en.wikipedia.org/wiki/10_Cloverfield_Lane,Action,David Ayer,0,Tom Cruise,0,0,0,0,"$20,000,000.00","$5,400,000.00"
freq,1,6,1,120,4,467,5,5,23,56,119,30,3

In [17]:
df[df.Genre == 'Action'].head()

,Movie Title,Release Date,Wikipedia URL,Genre,Director (1),Director (2),Cast (1),Cast (2),Cast (3),Cast (4),Cast (5),Budget,Revenue
1,13 Hours: The Secret Soldiers of Benghazi,2016-01-15,https://en.wikipedia.org/wiki/13_Hours:_The_Se...,Action,Michael Bay,0,James Badge Dale,John Krasinski,Toby Stephens,Pablo Schreiber,Max Martini,"$45,000,000.00","$69,400,000.00"
2,2 Guns,2013-08-02,https://en.wikipedia.org/wiki/2_Guns,Action,Baltasar Kormákur,0,Mark Wahlberg,Denzel Washington,Paula Patton,Bill Paxton,Edward James Olmos,"$61,000,000.00","$131,900,000.00"
4,22 Jump Street,2014-06-04,https://en.wikipedia.org/wiki/22_Jump_Street,Action,Phil Lord,Chris Miller,Channing Tatum,Jonah Hill,Ice Cube,0,0,"$84,500,000.00","$331,300,000.00"
5,300: Rise of an Empire,2014-03-04,https://en.wikipedia.org/wiki/300:_Rise_of_an_...,Action,Noam Murro,0,Rodrigo Santoro,Eva Green,Sullivan Stapleton,Hans Matheson,Lena Headey,"$110,000,000.00","$337,600,000.00"
7,71,2014-02-07,https://en.wikipedia.org/wiki/%252771_(film),Action,Yann Demange,0,Jack O'Connell,Richard Dormer,Sean Harris,Sam Reid,0,"$8,100,000.00","$2,900,000.00"

In [18]:
filter1 = df['Release Date']==df['Release Date'].max()
df[filter1][["Genre","Release Date"]]

         Genre Release Date
88    Thriller   2016-08-26
132  Biography   2016-08-26
200     Action   2016-08-26

In [19]:
df1=df.set_index('Movie Title')

In [20]:
df1.loc['Zoolander 2']

Release Date                                    2016-02-12
Wikipedia URL    https://en.wikipedia.org/wiki/Zoolander_2
Genre                                               Comedy
Director (1)                                   Ben Stiller
Director (2)                                             0
Cast (1)                                       Ben Stiller
Cast (2)                                       Owen Wilson
Cast (3)                                  Christine Taylor
Cast (4)                                      Will Ferrell
Cast (5)                                     Penélope Cruz
Budget                                      $50,000,000.00
Revenue                                     $56,000,000.00
Name: Zoolander 2, dtype: object

In [21]:
# loading a dataframe by pasing a dictionary
weather_data = {'day':['1/1/2017','1/2/2017','1/3/2017'],
                'temperature': [32,35,28],
                'windspeed':[6,7,2],
                'event':['Rain','Snow','Sunny']}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7   Snow
2  1/3/2017           28          2  Sunny

In [22]:
# loading dataframe by pasing a list of tuples
weather_data = [('1/1/2017',32,6,"Rain"),
                ('1/2/2017',35,7,"Sunny"),
                ('1/3/2017',28,2,"Snow")]

df= pd.DataFrame(weather_data,columns = ["date","Temperature","windspeed","event"])
df

       date  Temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [23]:
df_stocks = pd.DataFrame({
    'Ticker':['Google',"WMT","MSFT"],
    'Price':[845,65,64],
    'Pe': [ 30.37,14.26,30.97],
    'Eps':[27.82,4.61,2.12]

})

df_weather = pd.DataFrame({
                'day':['1/1/2017','1/2/2017','1/3/2017'],
                'temperature': [32,35,28],
                'windspeed':[6,7,2],
                'event':['Rain','Snow','Sunny']
})

In [26]:
with pd.ExcelWriter('Stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer,sheet_name='Stocks',index=False)
    df_weather.to_excel(writer,sheet_name = 'Weather',index=False)

In [51]:
df1 = pd.read_excel('Stocks_weather.xlsx',sheet_name='Weather',parse_dates=['day'])
df1

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         35.0        7.0   Snow
2 2017-01-03         28.0        2.0  Sunny
3 2017-01-04          NaN        4.0    NaN
4 2017-01-06          0.0        NaN  sunny
5 2017-01-07          NaN        NaN    NaN

In [52]:
df1.set_index('day',inplace=True)

In [53]:
df1

            temperature  windspeed  event
day
2017-01-01         32.0        6.0   Rain
2017-01-02         35.0        7.0   Snow
2017-01-03         28.0        2.0  Sunny
2017-01-04          NaN        4.0    NaN
2017-01-06          0.0        NaN  sunny
2017-01-07          NaN        NaN    NaN

In [54]:
new_df= df1.fillna({
    'temperature': 0,
    'windspeed': 0,
    'event': 'No event'
})

In [55]:
new_df

            temperature  windspeed     event
day
2017-01-01         32.0        6.0      Rain
2017-01-02         35.0        7.0      Snow
2017-01-03         28.0        2.0     Sunny
2017-01-04          0.0        4.0  No event
2017-01-06          0.0        0.0     sunny
2017-01-07          0.0        0.0  No event

In [58]:
new_df= df1.fillna(method='ffill')
new_df

            temperature  windspeed  event
day
2017-01-01         32.0        6.0   Rain
2017-01-02         35.0        7.0   Snow
2017-01-03         28.0        2.0  Sunny
2017-01-04         28.0        4.0  Sunny
2017-01-06          0.0        4.0  sunny
2017-01-07          0.0        4.0  sunny